{
	"projects": [
		{
			"date": [
				"November 2023"
			],
			"title": "Npmjs package: react-use-latest-state",
			"skills": [
				"React",
				"TypeScript"
			],
			"description": [
				"A lightweight React package that enhances the reliability of state values within functional components."
			],
			"links": {
				"github": "https://github.com/MakeItBuildIt/react_useLatestState",
				"npmjs": "https://www.npmjs.com/package/react-use-latest-state"
			}
		},
		{
			"date": [
				"October 2023"
			],
			"title": "Spell-iT Discord Bot",
			"skills": [
				"Discord.js",
				"Node.js",
				"MongoDB",
				"Micro-services",
				"JavaScript",
				"REST API"
			],
			"description": [
				"Spell-iT is a sophisticated but very interactive Discord bot which provides users with Spelling challenges and track scores."
			],
			"links": {
				"github": "https://github.com/SBTopZZZ-LG/discord_spellit",
				"discord": "https://discord.com/api/oauth2/authorize?client_id=1159883355433746503&permissions=2147941440&scope=bot"
			}
		},
		{
			"date": [
				"May",
				"June 2023"
			],
			"title": "Portfolio Website",
			"skills": [
				"React",
				"Figma",
				"HTML5",
				"CSS",
				"JavaScript"
			],
			"description": [
				"A portfolio website concept made in Figma and realized with React."
			],
			"links": {
				"github": "https://github.com/SBTopZZZ-LG/react-portfolio"
			}
		},
		{
			"date": [
				"February",
				"March 2023"
			],
			"title": "Aura 23 Website",
			"skills": [
				"React",
				"Node.js",
				"MongoDB",
				"Micro-services",
				"JavaScript",
				"REST API"
			],
			"description": [
				"A website made for KLS GIT's Aura festival. The website featured a curated list of all events, and also enabled users to sign up and register for the events online. The site also featured a unique and intuitive user interface.",
				"The website was designed to integrate with and utilize RazorPay, so that users could register and finalize the payments quickly. However, due to technical complications and timely constraints, the idea was resketched to accept UPI payments from users by displaying a QR code on the site, and then accepting the Transaction IDs from users for validation.",
				"The front-end was designed with React.js and other technologies like Tailwind CSS for faster productivity. The back-end was built with Node.js and Express.js, and MongoDB was our primary database. The site was hosted on AWS's EC2 instance (M6a instance). The website was live and in production for about 20 days.",
				"An admin panel (for event coordinators, to manage and track registrations) was also designed with React.js and advanced UI kits like Refine MUI, which was hosted on Netlify."
			],
			"links": {
				"github": "https://github.com/SBTopZZZ-LG/aura-git"
			}
		},
		{
			"date": [
				"November 2022",
				"February 2023"
			],
			"title": "CodeCollab",
			"skills": [
				"Java",
				"Socket Programming"
			],
			"description": [
				"CodeCollab is a software application that enables software developers to work on code collaboratively in real-time. The application is built using Java (Swing) and uses a TCP API to facilitate real-time communication between users.",
				"The application features a main code editor where multiple users can simultaneously edit the same codebase. The editor also includes a built-in chat feature that allows users to communicate with each other while working on the code. Users can join a session by providing a unique session code, which is generated by the user who initiates the session."
			],
			"links": {
				"github": "https://github.com/SBTopZZZ-LG/java_codecollab"
			}
		},
		{
			"date": [
				"October",
				"November 2022"
			],
			"title": "Flutter package: render_box_exposed",
			"skills": [
				"Flutter",
				"Dart"
			],
			"description": [
				"A flutter package to expose a widget's RenderBox."
			],
			"links": {
				"github": "https://github.com/SBTopZZZ-LG/flutter_render_box_exposed",
				"pub.dev": "https://pub.dev/packages/render_box_exposed"
			}
		},
		{
			"date": [
				"September 2022"
			],
			"title": "Archivit",
			"skills": [
				"Java"
			],
			"description": [
				"A Java program to create archives from directories. The program even allows users to create AES-256 password-protected archives."
			],
			"links": {
				"github": "https://github.com/SBTopZZZ-LG/java_archiver"
			}
		},
		{
			"date": [
				"February 2022"
			],
			"title": "Blog.io",
			"skills": [
				"HTML5",
				"CSS",
				"Node.js",
				"MongoDB",
				"JavaScript",
				"REST API"
			],
			"description": [
				"A blog website made with Vanilla HTML and CSS, supported by a Node.js back-end and MongoDB as the primary database."
			],
			"links": {
				"github": "https://github.com/SBTopZZZ-LG/web_project-blogio-frontend",
				"url": "https://sbtopzzz-lg.github.io/web_project-blogio-frontend/"
			}
		},
		{
			"date": [
				"January 2022"
			],
			"title": "Email Scheduler v2",
			"skills": [
				"Java"
			],
			"description": [
				"A Java program which enables users to automate and schedule emails on the fly. The program uses Google's Gmail API to automatically send emails to the target recipients."
			],
			"links": {
				"github": "https://github.com/SBTopZZZ-LG/java-emailscheduler-v2"
			}
		},
		{
			"date": [
				"June",
				"July 2021"
			],
			"title": "ClipIt",
			"skills": [
				"Flutter",
				"Node.js",
				"MongoDB",
				"Dart",
				"JavaScript",
				"REST API"
			],
			"description": [
				"A simple website which enables users to share their clipboards with other devices across internet. The front-end was made with Flutter, supported by a Node.js backend, and MongoDB as the primary database."
			],
			"links": {
				"github": "https://github.com/SBTopZZZ-LG/ClipIt-FlutterWeb",
				"url": "https://clip-it-web.netlify.app/"
			}
		},
		{
			"date": [
				"May",
				"June 2021"
			],
			"title": "SpeedPost",
			"skills": [
				"Android",
				"Java",
				"Node.js",
				"MongoDB",
				"JavaScript",
				"REST API"
			],
			"description": [
				"When it comes to Event organizing and inviting your friends and relatives, the situation is nothing more than just throwing off your bucks at invitation cards, also the fuel you use to deliver the invitation cards to the invitees. This isn't efficient, given that even a couple of hundred bucks can help you improve/work on your skills or even when it comes to investments.",
				"What if I told you, that we have a solution that will enable you to professionally organize and control Events, and also invite all your members, with just a single click and in a second?"
			],
			"links": {
				"github": "https://github.com/SBTopZZZ-LG/Quicc-Android"
			}
		}
	]
}